Repository: TYPO3-Extensions/sr_puzzle
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de, es, fi, fr, se

# pi1_title
source: Puzzle
es: Rompecabezas
fi: Palapeli
fr: Casse-tête
se: Pussel

# pi1_plus_wiz_description
source: Adds a puzzle to the page
de: Fügt ein Puzzle auf der Seite ein.
es: Añade un rompecabezas en la página
fi: Lisää palapeli sivulle
fr: Ajoute un casse-tête sur la page
se: Lägger ett pussel på sidan

source: Puzzle image:
de: Puzzlebild:
es: Imagen del rompecabezas:
fi: Palapelin kuva:
fr: Image du casse-tête:
se: Pusslets bild:

# puzzle_instructions
source: Use the mouse or a finger to drag the pieces and drop them in new positions.
es: Arrastra y suelta con el mouse o un dedo para reubicar las piezas.
fr: Utilisez la souris ou un doigt pour prendre les pièces et les changer de position.

# successMessage
source: Congratulations!
de: Herzlichen Glückwunsch!
es: ¡Ganaste!\n ¡Enhorabuena!
fi: Onneksi olkoon!
fr: Félicitations!
se: Gratulationer!

# image_not_found
source: Sorry, the requested image file was not found:
de: Sorry, die angegebene Bilddatei konnte nicht gefunden werden.:
es: Lo sentimos, pero no se encontró el archivo de imagen requerido:
fi: Valitan. haettua kuvaa ei löytynyt.
fr: Désolé, le fichier d'image demandé est introuvable:
se: Beklagar, men den sökta bildfilen finns inte:

# browser_too_old
source: Sorry, the puzzle requires a more recent browser.
de: Sorry, das Puzzle ist nicht mit Ihrem Browser kompatibel.
es: Lo sentimos, pero el rompecabezas requiere un navegador más reciente.
fi: Valitan, palapeli tarvitsee uudemman selaimen.
fr: Désolé, le casse-tête requiert un navigateur plus récent.
se: Beklagar, pusslet kräver en nyare version av webläsare.

# settings.puzzleWidth
source: Puzzle width:
es: Anchura del rompecabezas:
fr: Largeur du casse-tête:

# settings.puzzleHeight
source: Puzzle height:
es: Altura del rompecabezas:
fr: Hauteur du casse-tête:

# settings.pieceSize
source: Size of puzzle pieces:
de: Größe der Puzzleteile:
es: Tamaño de las piezas:
fi: Plapelin osasten koko:
fr: Dimension des pièces:
se: Pusselbitarnas storlek:

# settings.puzzleX
source: Horizontal offset:
de: Horizontaler Rand:
es: Posición horizontal:
fi: Vaakatason siirtymä:
fr: Position horizontale:
se: Vågrät avstånd:

# settings.puzzleY
source: Vertical offset:
de: Vertikaler Rand:
es: Posición vertical:
fi: Pystytason siirtymä:
fr: Position verticale:
se: Lodrät avstånd:

# settings.congratulationsLink
source: Open congratulations page:
de: Öffnet Seite zur Beglückwünschung:
es: Abrir página de felicitationes:
fr: Ouvrir une page de félicitations:
se: Öppna gratulationssida:

# settings.linkAfter
source: Go to this page upon success:
de: Öffnet Seite, wenn Puzzle erfolgreich gelöst:
es: Ir a esta página después de solucionar:
fi: Siirry sivulle kun kuva on onnistunut:
fr: Aller à cette page après solution:
se: Gå till denna sida då du lyckats lösa pusslet:

# update.upgradeTo6
source: Upgrade to version 6.0
fr: Migration à la version 6.0

# update.warning
source: Warning!
fr: Avertissement!

# update.changesToDatabase
source: This script will make changes to the database that will not work with versions of the extension lower than 6.0.
fr: Ce script apportera à la base de données des modifications qui ne fonctionneront pas avec les versions de cette extension antérieures à la version 6.0.

# update.update
source: Update
fr: Mettre à jour

# update.elementsUpdated
source: %1$d puzzle elements were updated.
fr: %1$d éléments de contenu de type "Casse-tête" ont été mis à jour.

# update.templatesUpdated
source: %1$d TypoScript templates were updated. Please verify the plugin configuration. You may need to move array _LOCAL_LANG from plugin.tx_srpuzzle.settings to plugin.tx_srpuzzle.
fr: %1$d gabarits TypoScript ont été mis à jour. Veuillez vérifier la configuration du greffon. Il est possible que vous ayez à déplacer le tableau _LOCAL_LANG depuis plugin.tx_srpuzzle.settings vers plugin.tx_srpuzzle.

# update.pleaseRead
source: Please read the manual for more information regarding the upgrade to version 6.0 of this extension.
fr: Vous trouverez dans le manuel plus d'informations concernant la migration à la version 6.0 de cette extension.

# puzzle_instructions
source: Use your mouse to drag the pieces and drop them in new positions.
de: Benutze die Maus um ein Puzzleteil aufzunehmen und lege es an der neuen Position ab.
fi: Käytä hiirtä vetääksesi palan ja pudottaaksesi sen uuteen paikkaan.
se: Använd musen till att dra pusselbitarna till deras rätta position.

# settings.completeLink
source: Open congratulations page:
fi: Avaakonfigurointi sivu:
